Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: It is the oldest book store of the country. The founders of the store are Ram Das Shrestha and Ratna Prasad Shrestha. For a Nepali, who is in fifties, Ratna Pustak Bhandar, would probably come to mind for book publication, distribution and retail sale.
ne: रत्न पुस्तक भण्डार नेपालकाे एक नीजी प्रकाशनगृह हाे । यसकाे स्थापना वि.सं. २००३ ताक काठमाण्डाैँका व्यापारी रत्नदास श्रेष्ठ र रत्नप्रसाद श्रेष्ठले गरेका थिए । यस प्रकाशनगृहले नेपाली र अङ्रेजी भाषामा भाषा, धर्म, साहित्य, संस्मरण अादि विधाका कृतिहरू प्रकाशित गर्ने गर्छ ।

source: "Ben Thapa — Profile on FixTheMusic". Cite web URL https://www.fixthemusic.com/ben-thapa Title Ben Thapa — Profile on FixTheMusic Last name FixTheMusic ↑ 'Bit of a laugh' ended in chart success' ↑ A life on the high Cs; Three years of success with an operatic boy band has left Jonathan Ansell with a taste for success ↑ 'I was such a pretty boy even my mother thought I was gay' ↑ X Factor's class act G4 reuniting for 2015 tour ↑ Ben Thapa - Live on BBC Radio Cambridgeshire ↑ G4 GONE FOREVER Archived July 25, 2014, at the Wayback Machine. ↑ Talent show tenor Ben Thapa is all heart ↑ G4 star Ben Thapa announces solo gig ↑ Former G4 star Ben Thapa on the band's one-night-only reunion
ne: "Ben Thapa — Profile on FixTheMusic". https://www.fixthemusic.com/ben-thapa. ↑ 'Bit of a laugh' ended in chart success' ↑ A life on the high Cs; Three years of success with an operatic boy band has left Jonathan Ansell with a taste for success ↑ 'I was such a pretty boy even my mother thought I was gay' ↑ X Factor's class act G4 reuniting for 2015 tour ↑ Ben Thapa - Live on BBC Radio Cambridgeshire ↑ G4 GONE FOREVER Archived July 25, 2014, at the Wayback Machine. ↑ Talent show tenor Ben Thapa is all heart ↑ G4 star Ben Thapa announces solo gig ↑ Former G4 star Ben Thapa on the band's one-night-only reunion

source: Arpan Thapa (Nepali: अर्पण थापा) (born November 15, 1979) [2] is a Nepali actor, director, and scriptwriter.
ne: Arpan Thapa (नेपाली: अर्पण थापा) (born November 15, 1979) [2] is a Nepali actor, director, and scriptwriter.

source: Arpan Thapa at the Internet Movie Database
ne: इन्टरनेट चलचित्र डेटाबेसमा अर्पण थापा

source: ↑ "Radio Kantipur- 96.1, 101.8 MHz: Nepal's most listened Radio Station". Radiokantipur.ekantipur.com. Retrieved 2016-06-02. ↑ "Arpan Thapa (अर्पन थापा) >>Biography". reelnepal.com.
ne: ↑ "Radio Kantipur- 96.1, 101.8 MHz: Nepal's most listened Radio Station".

source: Retrieved December 24, 2015.
ne: Radiokantipur.ekantipur.com.

source: Cite web URL http://reelnepal.com/name/33537/arpan-thapa/biography Title Arpan Thapa (अर्पन थापा) >>Biography Publisher reelnepal.com URL access date December 24, 2015 ↑ "Birami Sahar (Sick City) (2011)". IMDb.com. Retrieved December 24, 2015.
ne: Retrieved 2016-06-02. ↑ "Arpan Thapa (अर्पन थापा) >>Biography". reelnepal.com. http://reelnepal.com/name/33537/arpan-thapa/biography. अन्तिम पहुँच मिति: December 24, 2015. ↑ "Birami Sahar (Sick City) (2011)".

source: Cite web URL http://www.imdb.com/title/tt1884254/ Title Birami Sahar (Sick City) (2011) Publisher IMDb.com URL access date December 24, 2015 ↑ "Nepali Movie – Mukhauta". xnepali.com. Retrieved December 24, 2015. Cite web URL http://xnepali.net/movies/nepali-movie-mukhauta/ Title Nepali Movie – Mukhauta Publisher xnepali.com URL access date December 24, 2015 1 2 "In Character Arpan Thapa's Alter Egos | Features".
ne: IMDb.com. http://www.imdb.com/title/tt1884254/. अन्तिम पहुँच मिति: December 24, 2015. ↑ "Nepali Movie – Mukhauta". xnepali.com. http://xnepali.net/movies/nepali-movie-mukhauta/. अन्तिम पहुँच मिति: December 24, 2015.

source: Living.com.np. 2014-04-20. Retrieved 2016-06-02. ↑ "Arpan Thapa (अर्पन थापा)".
ne: 1 2 "In Character Arpan Thapa's Alter Egos | Features".

source: Reel Nepal. Qubex. Retrieved 23 November 2015. ↑ Devi, Mia (2013-10-24).
ne: Living.com.np.

source: Retrieved 2016-06-02. ↑ Thapa, Rabi. "Signs of life". Nepali Times.
ne: Retrieved 2016-06-02. ↑ "Arpan Thapa (अर्पन थापा)".

source: Retrieved 17 November 2015. ↑ "Dhanda(2012) - Nepali Movie - Full Cast". Reelnepal.com. Retrieved 2016-06-02. ↑ Devi, Mia (2013-02-24).
ne: Qubex. http://reelnepal.com/name/33537/arpan-thapa/biography. अन्तिम पहुँच मिति: 23 November 2015. ↑ Devi, Mia (2013-10-24).

source: "Nepali Film – Chadke (2013)". Films of Nepal.
ne: "Nepali Film – Batch No. 16 (2011)".

source: Retrieved 2016-06-02. ↑ Devi, Mia (2013-11-08). "Nepali Film – Badhashala (2013)". Films of Nepal.
ne: Films of Nepal. http://filmsofnepal.com/nepali-film-batch-no-16-2011/. अन्तिम पहुँच मिति: 2016-06-02. ↑ Thapa, Rabi.

source: Retrieved 2016-06-02. ↑ Alesves.
ne: "Signs of life".

source: "Enciclopedia del Cine Español: Katmandú, un espejo en el cielo (2011)". Enciclopediacineespa-fernando.blogspot.com. Retrieved 2016-06-02. ↑ Devi, Mia (2013-09-28).
ne: Nepali Times. http://nepalitimes.com/news.php?id=18056#.VksPv9KrS70. अन्तिम पहुँच मिति: 17 November 2015. ↑ "Dhanda(2012) - Nepali Movie - Full Cast". http://reelnepal.com/movies/21190/dhanda/cast. अन्तिम पहुँच मिति: 2016-06-02. ↑ Devi, Mia (2013-02-24).

source: "Nepali Film – Maun (2013)".
ne: "Nepali Film – Chadke (2013)".

source: Films of Nepal. Retrieved 2016-06-02. ↑ "NEFTA Film Award 2015 Qatar : An event by Nepal Film Technical Association".
ne: Films of Nepal. http://filmsofnepal.com/nepali-film-chadke-2013/. अन्तिम पहुँच मिति: 2016-06-02. ↑ Devi, Mia (2013-11-08).

source: Ekantipur.com.
ne: "Nepali Film – Badhashala (2013)".

source: 1979-11-17. Retrieved 2016-06-02. ↑ "Dying Candle (2016)".
ne: Films of Nepal. http://filmsofnepal.com/nepali-film-badhashala-2013/. अन्तिम पहुँच मिति: 2016-06-02. ↑ Alesves.

source: IMDb.com\Accessdate=2016-06-02. ↑ "Bir Bikram, a movie by Milan Chams to feature Diya » Nepali Movies, Nepali Films". Xnepali.net. Retrieved 2016-06-02. ↑ "Bato Muniko Phool 2 - बाटो मुनिको फूल २".
ne: "Enciclopedia del Cine Español: Katmandú, un espejo en el cielo (2011)". http://enciclopediacineespa-fernando.blogspot.com/2013/12/katmandu-un-espejo-en-el-cielo-2011.html. अन्तिम पहुँच मिति: 2016-06-02. ↑ Devi, Mia (2013-09-28).

source: Facebook. 2016-04-22. Retrieved 2016-06-02. ↑ "Hamlet to exact revenge in Capital".
ne: "Nepali Film – Maun (2013)".

source: The Himalayan Times. Retrieved 2016-06-02. ↑ "Priyanka Will Be Onscreen Wife Of Arpan Thapa In 'Anaagat' – Fursad Nepal". Fursadnepal.com.
ne: Films of Nepal. http://filmsofnepal.com/nepali-film-maun-2013/. अन्तिम पहुँच मिति: 2016-06-02. ↑ "NEFTA Film Award 2015 Qatar : An event by Nepal Film Technical Association".

source: Retrieved 2016-06-02.
ne: 1979-11-17. http://www.ekantipur.com/nefta2015/index.php/index/nominee/26. अन्तिम पहुँच मिति: 2016-06-02. ↑ "Dying Candle (2016)". http://www.imdb.com/title/tt3552320/. ↑ "Bir Bikram, a movie by Milan Chams to feature Diya » Nepali Movies, Nepali Films". http://xnepali.net/movies/bir-bikram-a-movie-by-milan-chams-to-feature-diya/. अन्तिम पहुँच मिति: 2016-06-02. ↑ "Bato Muniko Phool 2 - बाटो मुनिको फूल २". Facebook. 2016-04-22. https://www.facebook.com/batomunikophool2/info?tab=page_info. अन्तिम पहुँच मिति: 2016-06-02. ↑ "Hamlet to exact revenge in Capital". अन्तिम पहुँच मिति:2016-06-02. ↑ "Priyanka Will Be Onscreen Wife Of Arpan Thapa In ‘Anaagat’ – Fursad Nepal". http://fursadnepal.com/priyanka-will-be-onscreen-wife-of-arpan-thapa-in-anaagat/. अन्तिम पहुँच मिति: 2016-06-02.

source: Ram Bahadur Bomjon (Sanskrit: राम बहादुर बामजान) (born c.
ne: Ram Bahadur Bomjon (संस्कृत: राम बहादुर बामजान) (born c.

source: A video was made of the event.[9] According to Krishna Hari, a blogger who wrote an article and took pictures of the meeting, Bomjon's message was, "The only way we can save this nation is through spirituality".[10]
ne: A video was made of the event.[9][not in citation given] According to Krishna Hari, a blogger who wrote an article and took pictures of the meeting, Bomjon's message was, "The only way we can save this nation is through spirituality".[10]

source: On 10 November 2008, Bomjon reappeared and gave blessings to approximately 400,000 pilgrims over a 12-day period in the remote jungle of Ratanpuri, 150 km (93 mi) southeast of Kathmandu, near Nijgadh.
ne: On 10 November 2008, Bomjon reappeared and gave blessings to approximately 400,000 pilgrims over a 12-day period in the remote jungle of Ratanpuri, [convert: संख्या आवश्यक छ] southeast of Kathmandu, near Nijgadh.

source: On 19 March 2006, a group of Bomjon's followers met with him about 2 miles (3.2 km) southwest of his meditation site.
ne: On 19 March 2006, a group of Bomjon's followers met with him about [convert: संख्या आवश्यक छ] southwest of his meditation site.

source: He left a message for his parents telling them not to worry.[5]
ne: He left a message for his parents telling them not to worry.[5][not in citation given]

source: A new wave of visitors came to see him and pray at his new meditation spot.[7]
ne: A new wave of visitors came to see him and pray at his new meditation spot.[7][not in citation given]

source: Retrieved February 11, 2014. ↑ Navin Singh Khadka (30 November 2005). "Scientists to check Nepal Buddha boy". BBC.
ne: Retrieved February 11, 2014. ↑ Navin Singh Khadka.

source: Kathmandu. Retrieved 5 February 2014. ↑ Bhagirath Yogi (11 March 2006). "Nepal's 'Buddha' boy goes missing".
ne: "Scientists to check Nepal Buddha boy", 30 November 2005. अन्तिम पहुँच मिति:5 February 2014. ↑ Bhagirath Yogi.

source: BBC. ↑ "Nepalese Buddha Boy 'reappears'". BBC. 20 March 2006. ↑ Bell, Thomas (27 Dec 2006).
ne: "Nepal's 'Buddha' boy goes missing", BBC, 11 March 2006. ↑ "Nepalese Buddha Boy 'reappears'", BBC, 20 March 2006. ↑ Bell, Thomas.

source: "Buddha Boy found after retreating into jungle". The Telegraph. Retrieved 26 October 2015. ↑ "Nepal Buddha Boy 'sighted again'".
ne: "Buddha Boy found after retreating into jungle", The Telegraph, 27 Dec 2006. अन्तिम पहुँच मिति:26 October 2015. ↑ "Nepal Buddha Boy 'sighted again'", BBC, 26 December 2006. ↑ Buddha Boy Update: Ram Bahadur Bomjon Now Meditating in Pit.

source: BBC. 26 December 2006. ↑ Buddha Boy Update: Ram Bahadur Bomjon Now Meditating in Pit.
ne: 28 March 2007 ↑ "Video Clip Taken in Halkhoriya Jungle in August 2, 2007(Sharawan 17 th)".

source: 28 March 2007 ↑ "Video Clip Taken in Halkhoriya Jungle in August 2, 2007(Sharawan 17 th)". Official Site of Ram Bahadur Bomjan. Archived from the original on December 17, 2008. ↑ Ram Bahadur Bomjom, the Buddha Boy, Starts Preaching: Arrival of a Meditation Guru or a Religious Zealot?.
ne: Archived from the original on December 17, 2008. https://web.archive.org/web/20081217171833/http://www.paldendorje.com/pvdo.php. ↑ Ram Bahadur Bomjom, the Buddha Boy, Starts Preaching: Arrival of a Meditation Guru or a Religious Zealot?.

source: The Incredible Buddha Boy ↑ Indra Adhikari (12 March 2006).
ne: The Incredible Buddha Boy ↑ Indra Adhikari.

source: "The "Little Buddha" goes missing". Nepalnews.com. Archived from the original on 28 March 2006. ↑ "Om Namo Guru Buddha Gyani".
ne: "The "Little Buddha" goes missing", Nepalnews.com, 12 March 2006. ↑ "Om Namo Guru Buddha Gyani".

source: Archived from the original on November 30, 2010. Retrieved 2012-02-17. ↑ Lang, Olivia (2010-07-27). "Nepal's 'Buddha boy' investigated for attacking group".
ne: Archived from the original on November 30, 2010. https://web.archive.org/web/20101130115338/http://www.paldendorje.com/. अन्तिम पहुँच मिति: 2012-02-17. ↑ Lang, Olivia (2010-07-27).

source: BBC. Retrieved 2012-02-17.
ne: "Nepal's 'Buddha boy' investigated for attacking group".

source: Cite web URL http://www.bbc.co.uk/news/world-south-asia-10776957 Title Nepal's 'Buddha boy' investigated for attacking group Last name Lang First name Olivia Source date 2010-07-27 Publisher BBC URL access date 2012-02-17
ne: BBC. http://www.bbc.co.uk/news/world-south-asia-10776957. अन्तिम पहुँच मिति: 2012-02-17.

source: ↑ "Police History - Ex-Chief of Police". Retrieved 2013-04-10. ↑ "Shyam KC Republica". ↑ "Some legends about King Mahendra-2". ↑ "Some legends about King Mahendra-1". ↑ "Ex Consul Generals for Nepal Consulate General, Kolkata". Retrieved 2013-12-22. ↑ "RUM!".
ne: ↑ "Police History - Ex-Chief of Police". http://www.nepalpolice.gov.np/police-history/ex-chief-of-police.html. अन्तिम पहुँच मिति: 2013-04-10. ↑ "Shyam KC Republica". http://archives.myrepublica.com/portal/index.php?action=news_details&news_id=20283. ↑ "Some legends about King Mahendra-2". http://www.peoplesreview.com.np/index.php/articles/those-were-the-days/item/282-some-legends-about-king-mahendra-2. ↑ "Some legends about King Mahendra-1". http://www.peoplesreview.com.np/index.php/articles/those-were-the-days/item/234-some-legends-about-king-. ↑ "Ex Consul Generals for Nepal Consulate General, Kolkata". http://www.nepalconsulategeneral.in/index.php/notice-press-releases/11-general-information. अन्तिम पहुँच मिति: 2013-12-22. ↑ "RUM!". http://www.nepalpicturelibrary.org/archives/160.

source: The palace complex lied in the heart of Kathmandu city, to the north of the bagmati river.[1] The history of the palace is closely linked with the history of Nepal and its rulers.
ne: The palace complex lied in the heart of Kathmandu city, to the north of the bagmati river. The history of the palace is closely linked with the history of Nepal and its rulers.

source: Coordinates: 27°41′28″N 85°18′57″E﻿ / ﻿27.691111°N 85.315833°E﻿ / 27.691111; 85.315833 Thapathali Durbar was a palace complex in Kathmandu, the capital of the Nepal.
ne: निर्देशाङ्क: २७°४१′२८″उत्तर ८५°१८′५७″पूर्व﻿ / ﻿२७.६९११११° उत्तर ८५.३१५८३३° पूर्व﻿ / 27.691111; 85.315833 Thapathali Durbar was a palace complex in Kathmandu, the capital of the Nepal.

source: 2014-10-19. Retrieved 2015-06-05.
ne: 2014-10-19. http://www.shankerhotel.com.np/blog/2014/10/19/the-historic-durbars-of-kathmandu/. अन्तिम पहुँच मिति: 2015-06-05.

source: 2014-10-19. Retrieved 2015-06-05. Cite web URL http://www.shankerhotel.com.np/blog/2014/10/19/the-historic-durbars-of-kathmandu/ Title THE HISTORIC DURBARS OF KATHMANDU Source date 2014-10-19 URL access date 2015-06-05 ↑ http://www.thetaranights.com/baghdurbar-the-tiger-palace/ ↑ http://nepalitimes.com/blogs/mycity/2015/05/20/rana-palaces-after-the-earthquake/
ne: 2014-10-19. http://www.shankerhotel.com.np/blog/2014/10/19/the-historic-durbars-of-kathmandu/. अन्तिम पहुँच मिति: 2015-06-05. ↑ http://www.thetaranights.com/baghdurbar-the-tiger-palace/ ↑ http://nepalitimes.com/blogs/mycity/2015/05/20/rana-palaces-after-the-earthquake/

source: Karki Khadka
ne: खड्का

source: Pahal Singh Lama पहल सिंह लामा 8th Inspector General of Nepal Police In office December, 1961 – July, 1966 Monarch King Mahendra Prime Minister Tulsi Giri Preceded by Dhundi Raj Sharma Succeeded by Rom Bahadur Thapa Consul General of Calcutta Monarch King Mahendra Prime Minister Surya Bahadur Thapa Preceded by Gahendra Shumsher Thapa Succeeded by Rom Bahadur Thapa Personal details Citizenship Nepalese Nationality Nepal Occupation Military Officer Police officer Diplomat Military service Allegiance Nepal Service/branch Rakshya Dal (Defense Army) Rank Major
ne: Pahal Singh Lama प्रधान मंत्री Tulsi Giri पूर्ववर्ती Dhundi Raj Sharma उत्तरावर्ती Rom Bahadur Thapa जन्म व्यवसाय Military Officer Police officer Diplomat

source: ↑ Lakshmibhakta Rāja Dui kurā 1962 "आइ', जी० (वर्तमान आइ० जी० पी० ) श्री पहल सिंह लामा-भूले राहियता र नेपाली भाषाको रक्षाको निमित्त नेपालीहरूलाई महत गडि गुन सामयिक र प्रशंसनीय कार्य स भयो, उथले लगता भएको त्यों ..." ↑ Nepal press digest Regmi Research Project - 1965 v9 p49 "The term of office of Pahal Singh Lama, Inspector-General of Police, which was due to expire on December 16, was extended by V months." ↑ "Police History - Ex-Chief of Police". Retrieved 2013-04-10. Cite web URL http://www.nepalpolice.gov.np/police-history/ex-chief-of-police.html Title Police History - Ex-Chief of Police URL access date 2013-04-10 ↑ Nepal press report Regmi Research Project - 1974- 100-199 p22 "According to another report, Pahal Singh Lama is being appointed as General Manager of the National Trading Ltd, and Madhukar shamsher Rana as Deputy General Manager. " ↑ "Ex Consul Generals for Nepal Consulate General, Kolkata".
ne: ↑ Lakshmibhakta Rāja Dui kurā 1962 "आइ', जी० (वर्तमान आइ० जी० पी० ) श्री पहल सिंह लामा-भूले राहियता र नेपाली भाषाको रक्षाको निमित्त नेपालीहरूलाई महत गडि गुन सामयिक र प्रशंसनीय कार्य स भयो, उथले लगता भएको त्यों ..." ↑ Nepal press digest Regmi Research Project - 1965 v9 p49 "The term of office of Pahal Singh Lama, Inspector-General of Police, which was due to expire on December 16, was extended by V months." ↑ "Police History - Ex-Chief of Police". http://www.nepalpolice.gov.np/police-history/ex-chief-of-police.html. अन्तिम पहुँच मिति: 2013-04-10. ↑ Nepal press report Regmi Research Project - 1974- 100-199 p22 "According to another report, Pahal Singh Lama is being appointed as General Manager of the National Trading Ltd, and Madhukar shamsher Rana as Deputy General Manager. " ↑ "Ex Consul Generals for Nepal Consulate General, Kolkata". http://www.nepalconsulategeneral.in/index.php/notice-press-releases/11-general-information. अन्तिम पहुँच मिति: 2013-12-22.

source: IGP (Inspector General of Nepal Police) Gyan Bahadur Yakthumba ज्ञानबहादुर याक्थुम्बा 3rd Inspector General of Nepal Police In office December, 1953 – August, 1955 Monarch King Tribhuvan Prime Minister Matrika Prasad Koirala Preceded by Nara Shumsher J.B.R. Succeeded by Gopal Shumsher J.B.R. Ambassador of Nepal to Burma In office 1965 – 1st March, 1970 Monarch King Mahendra Prime Minister Surya Bahadur Thapa Preceded by Unknown Succeeded by Unknown Personal details Born 16th March, 1920[1] Silange Basti[1] Died 1st March, 1970[2] Citizenship Nepalese Nationality Nepalese Political party Nepali Congress Spouse(s) Indira Yakthumba (Founder of Gyanodaya School in Nepal) Children 3 sons, 2 daughters Madhukar Yakthumba (eldest son), Prabhakar Yakthumba (son), Nirakar Yakthumba (youngest son), Bharati Yakthumba (elder daughter), Nirvana Yakthumba (daughter)[3] Occupation Military Officer Police officer Diplomat Awards Gorkha Dakshin Bahu Class I (1964)[4] Tri Shakti Patta Class I (1967)[5] Military service Allegiance Nepal Service/branch Fourth Regiment of Burmese Army Rakshya Dal (Defense Army) Rank Lieutenant in the Burmese Army Major in the Defense Army
ne: Gyan Bahadur Yakthumba पूर्ववर्ती Nara Shumsher J.B.R. उत्तरावर्ती Gopal Shumsher J.B.R. कार्यकाल 1965 – 1st March, 1970 प्रधान मंत्री Surya Bahadur Thapa पूर्वाधिकारी Unknown उत्तराधिकारी Unknown जन्म 16th March, 1920[1] Silange Basti[1] मृत्यु 1st March, 1970[2] राजनैतिक पार्टी Nepali Congress जीवनसंगी Indira Yakthumba (Founder of Gyanodaya School in Nepal)

source: Gyan Bahadur Yakthumba was described as a soldier, freedom fighter, crusader of the oppressed and under privileged, champion of civil liberty, human rights and justice, and a diplomat.[6] He joined the Nepali Police with the rank of Major and was promoted to the rank of Inspector General of Nepal Police, after succeeding Nara Shumsher J.B.R. as the police chief.
ne: Gyan Bahadur Yakthumba was described as a soldier, freedom fighter, crusader of the oppressed and under privileged, champion of civil liberty, human rights and justice, and a diplomat.[6][unreliable source?] He joined the Nepali Police with the rank of Major and was promoted to the rank of Inspector General of Nepal Police, after succeeding Nara Shumsher J.B.R. as the police chief.

source: "MRS,INDIRA YAKTHUMBA (LIMBU)". lojesub.blogspot.com. Retrieved August 16, 2015.
ne: "MRS,INDIRA YAKTHUMBA (LIMBU)". http://lojesub.blogspot.com.au/2009_02_01_archive.html.

source: Late Mr. Yakthumba was a man of multi-faceted personality - a soldier, freedom fighter, crusader of the oppressed and under privileged, champion of civil liberty, human rights and justice and a diplomat - who accomplished his every role with consummate skill ,courage, commitment, grace and dignity. Gyanodaya Bal Batika School Founder Principal ↑ Dr. Govind Prasad Thapa.
ne: Late Mr. Yakthumba was a man of multi-faceted personality - a soldier, freedom fighter, crusader of the oppressed and under privileged, champion of civil liberty, human rights and justice and a diplomat - who accomplished his every role with consummate skill ,courage, commitment, grace and dignity.

source: "Community policing in Nepal". crimejustice.blogspot.com.au.
ne: Gyanodaya Bal Batika School Founder Principal" ↑ Dr. Govind Prasad Thapa.

source: Cite web URL http://crimejustice.blogspot.com/2008/03/community-policing-in-nepal.html Title Community policing in Nepal Last name Dr. Govind Prasad Thapa Website crimejustice.blogspot.com.au ↑ "Police History - Ex-Chief of Police". March 2008.
ne: "Community policing in Nepal". http://crimejustice.blogspot.com/2008/03/community-policing-in-nepal.html. ↑ "Police History - Ex-Chief of Police".

source: Cite web URL http://www.nepalpolice.gov.np/police-history/ex-chief-of-police.html Title Police History - Ex-Chief of Police Source date March 2008
ne: March 2008. http://www.nepalpolice.gov.np/police-history/ex-chief-of-police.html.

source: Major Bahadur Singh Baral (Nepali: बहादुर सिंह बराल) (15 April 1892 – 16 October 1962) was a national poet [1] of Nepal [2] and a military officer in the First Gorkha Rifle of the British Indian Army.
ne: Major Bahadur Singh Baral (नेपाली: बहादुर सिंह बराल) (15 April 1892 – 16 October 1962) was a national poet [1] of Nepal [2] and a military officer in the First Gorkha Rifle of the British Indian Army.

source: ↑ "Madhyakalin Kabyik Kriti...". Cite web URL http://www.books.google.com.np/books?isbn=8172013248 Title Madhyakalin Kabyik Kriti... ↑ K. V. Singh Political profiles of modern India 2005 p335 "Durga Malla had drawn inspiration from the poet and social reformer Subedar-Major Bahadur Singh Baral and the musician and playwright Mitra Sen Thapa." ↑ "The Khukri Chronicles". Outlook India.
ne: ↑ "Madhyakalin Kabyik Kriti...". http://www.books.google.com.np/books?isbn=8172013248. [dead link] ↑ K. V. Singh Political profiles of modern India 2005 p335 "Durga Malla had drawn inspiration from the poet and social reformer Subedar-Major Bahadur Singh Baral and the musician and playwright Mitra Sen Thapa." ↑ "The Khukri Chronicles".

source: Cite web URL http://www.outlookindia.com/printarticle.aspx?278930 Title The Khukri Chronicles Publisher [[Outlook India]]
ne: Outlook India. http://www.outlookindia.com/printarticle.aspx?278930.

source: Ranjit Gazmer (Nepali: रन्जित गजमेर) is an Indian Gorkha musician of Kaliwood and Bollywood films.
ne: Ranjit Gazmer (नेपाली: रन्जित गजमेर) is an Indian Gorkha musician of Kaliwood and Bollywood films.

source: May 14, 2007. Retrieved 19 July 2012. Cite web URL http://www.telegraphindia.com/1070514/asp/siliguri/story_7772191.asp Title Nepali Madal Man in Mumbai Source date May 14, 2007 Publisher The Telegraph URL access date 19 July 2012 ↑ "Ranjit Gazmer: My mother's favourite son!".
ne: May 14, 2007. http://www.telegraphindia.com/1070514/asp/siliguri/story_7772191.asp. अन्तिम पहुँच मिति: 19 July 2012. ↑ "Ranjit Gazmer: My mother's favourite son!".

source: Darjeeling Times. June 30, 2009.
ne: Darjeeling Times.

source: Retrieved 19 July 2012. Cite web URL http://www.darjeelingtimes.com/news/news/Ranjit-Gazmer-My-mothers-favourite-son.html Title Ranjit Gazmer: My mother's favourite son! Source date June 30, 2009 Publisher Darjeeling Times URL access date 19 July 2012
ne: June 30, 2009. http://www.darjeelingtimes.com/news/news/Ranjit-Gazmer-My-mothers-favourite-son.html. अन्तिम पहुँच मिति: 19 July 2012.

source: The Kirksville Daily Express. 2012-04-17.
ne: The Kirksville Daily Express.
